myrottenpotatoes/app/controllers/application_controller.rb

SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_current_user
        # we exploit the fact that the below query may return nil
        @current_user ||= Moviegoer.find(session[:user_id])