myrottenpotatoes/app/controllers/reviews_controller.rb

  def has_moviegoer_and_movie
    unless @current_user
      flash[:warning] = 'You must be logged in to create a review.'
      redirect_to login_path
    end
    unless (@movie = Movie.find(params[:movie_id]))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    potatoes_value = params[:review][:potatoes]
    @current_user.reviews << @movie.reviews.build(potatoes: potatoes_value)
---
INSERT INTO "reviews" ("potatoes", "comments", "moviegoer_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["potatoes", 5], ["comments", nil], ["moviegoer_id", 1], ["movie_id", 2], ["created_at", "2023-11-19 02:42:11.599252"], ["updated_at", "2023-11-19 02:42:11.599252"]]

  def update
    @movie = Movie.find(params[:movie_id])
    @review = @movie.reviews.find(params[:id])
    potatoes_value_update = params[:review][:potatoes]
    @review.update(:potatoes => potatoes_value_update)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 2], ["id", 3], ["LIMIT", 1]]
UPDATE "reviews" SET "potatoes" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["potatoes", 4], ["updated_at", "2023-11-19 02:42:26.554875"], ["id", 3]]