myrottenpotatoes/app/controllers/sessions_controller.rb

SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."provider" = ? AND "moviegoers"."uid" = ? LIMIT ?  [["provider", "twitter2"], ["uid", "1724312853220331520"], ["LIMIT", 1]]
INSERT INTO "moviegoers" ("name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Auzhlten12"], ["provider", "twitter2"], ["uid", "1724312853220331520"], ["created_at", "2023-11-15 05:27:50.985240"], ["updated_at", "2023-11-15 05:27:50.985240"]]
---
  def create
    auth = request.env['omniauth.auth']
    user = Moviegoer.find_by(provider: auth['provider'], uid: auth['uid'])

    if user.nil?
      # El usuario no existe, crea un nuevo usuario si es necesario
      user = Moviegoer.create(provider: auth['provider'], uid: auth['uid'], name: auth['info']['name'])